# 7회

## 1유형

### 1. 국어,수학,영어,과학 과목 중 가장 많은 학생들이 응시한 시험을 선택하고 해당과목의 점수를 표준화 했을 때 가장 큰 표준화 점수를 구하여라

In [2]:
import pandas as pd

df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e7_p1.csv')
df.head()

     학생    국어    수학    영어    과학
0  ID_0  63.0   NaN  79.0  84.0
1  ID_1  91.0  93.0   NaN  73.0
2  ID_2  59.0  55.0   NaN  56.0
3  ID_3  71.0  83.0  82.0   NaN
4  ID_4  62.0  72.0  56.0   NaN

In [10]:
df.isnull().sum()    # 가장 많이 응시한 시험: 국어

학생    0
국어    2
수학    3
영어    4
과학    6
dtype: int64

In [ ]:
df['표준화'] = ( df['국어'] - df['국어'].mean()) / df['국어'].std(ddof=0)  # ddof=0 설정해줘야 모표준편차 나옴

In [20]:
df['표준화'].max()

1.713855688712825

### 2. 32개의 변수간 상관관계를 확인 했을 때, var_11 컬럼과 상관계수의 절댓값이 가장 큰 변수를 찾아 해당 변수의 평균값을 구하여라.

In [34]:
import pandas as pd

df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e7_p2_.csv')

In [35]:
df

,var_1,var_2,var_3,var_4,var_5,var_6,var_7,var_8,var_9,var_10,...,var_23,var_24,var_25,var_26,var_27,var_28,var_29,var_30,var_31,var_32
0,-0.335864,-2.425701,0.452851,-1.381924,-0.425591,-1.461498,-0.417082,-0.944226,-0.351224,1.474046,...,1.715714,0.300227,0.439828,-0.094772,1.551995,3.308446,-0.391377,1.963829,-1.458605,-0.348652
1,0.803535,-0.699433,0.095579,0.788053,-0.267674,-0.370746,0.636034,-1.674584,-0.058465,-1.188973,...,-1.348879,-0.899480,-1.271886,0.333734,-0.373565,-2.091508,-0.715245,-0.688441,0.910927,-0.746899
2,-0.408470,-0.361105,-0.857278,0.338294,2.317821,-0.099928,0.557053,-0.847932,0.973471,0.101203,...,-0.388353,0.918553,-1.984422,0.385055,1.161414,-1.280253,2.831802,-0.953771,-0.228466,0.766254
3,-0.690599,0.777928,-0.079963,0.164086,1.721702,0.146761,-0.988636,0.885344,0.647053,0.674609,...,0.337074,-1.406224,-0.699728,-0.836068,-0.226315,1.260893,-0.781630,-0.219995,0.871289,0.017578
4,0.179819,-0.668267,0.381849,-0.884196,0.758519,-1.026190,0.986227,-1.663167,2.290551,0.564845,...,-0.700137,-0.153825,-1.835313,0.182131,0.890247,0.024791,1.489955,1.276357,-0.285144,1.066486
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,0.490434,-1.197004,-0.479932,0.742293,0.030237,-0.917399,-0.456485,-0.073727,0.315860,0.494952,...,0.051177,-0.352919,1.165803,1.022760,-0.430430,-1.752405,1.268725,0.835590,-0.640479,0.896333
996,-0.473478,-0.288961,0.760027,0.290169,1.480012,-0.133223,-0.253417,-1.694322,-0.619197,-1.656501,...,0.039316,1.581424,-0.031658,1.527934,0.515152,-1.323778,0.122720,1.677778,-1.499085,1.061794
997,0.466743,-0.590503,0.018420,-0.466678,-0.546611,-2.276084,0.015573,2.168013,-0.669260,0.289482,...,0.145285,1.673797,0.640994,0.628243,0.202849,0.373191,0.677001,1.200631,-0.681883,-1.426339
998,-0.662948,-0.472974,0.246858,-1.258131,-1.345171,0.517870,-0.410059,-0.700673,0.101443,-0.623119,...,1.501711,-1.109268,1.454441,-2.391655,0.652381,0.478351,-0.191029,-1.120244,1.964952,0.372213
999,0.544267,1.727658,0.308647,-1.622876,0.858703,-0.263262,-0.325299,-0.298618,0.991313,0.099296,...,1.063176,-0.191063,-1.026710,0.945256,2.150945,0.459874,0.589407,1.764326,-0.121256,1.208216

In [ ]:
num_2 = df.corr()
num_2['var_11'].abs().sort_values()   # var_28이 제일 큼

var_32    0.024758
var_24    0.028243
var_14    0.039606
var_26    0.057167
var_20    0.082657
var_6     0.086658
var_15    0.090952
var_13    0.097608
var_5     0.105060
var_17    0.108236
var_21    0.116214
var_12    0.126660
var_19    0.135727
var_25    0.139099
var_7     0.155746
var_10    0.159161
var_4     0.163446
var_31    0.167667
var_18    0.170196
var_27    0.173340
var_9     0.186233
var_2     0.193347
var_22    0.193929
var_3     0.195323
var_23    0.199264
var_29    0.203869
var_8     0.227340
var_30    0.243578
var_1     0.311209
var_16    0.327004
var_28    0.392672
var_11    1.000000
Name: var_11, dtype: float64

In [41]:
df['var_28'].mean()

-0.06289356546077182

### 3. var_6 컬럼의 1,3사분위수 각각 IQR의 1.5배 벗어난 이상치의 숫자를 구하라

In [49]:
iqr = df['var_6'].quantile(0.75) - df['var_6'].quantile(0.25)
lst = list()
for i in range(len(df)):
    if (df.var_6[i] < (df['var_6'].quantile(0.25) - iqr * 1.5)) | (df.var_6[i] > (df['var_6'].quantile(0.75) + iqr * 1.5)):
        lst.append(i)

len(lst)

8

In [47]:
df.var_6[0]

-1.4614984092198338

## 2유형

In [50]:
import pandas as pd

train = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e7_p2_train2.csv')
test = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e7_p2_test2.csv')

display(train.head(2))
test.head(2)

        ID      연월  업종명 이용자구분    성별  이용자수   이용건수        이용금액
0  ID_5020  202201  여관업    법인  알수없음  7693  12105  3049021809
1  ID_5021  202201  여관업  제주도민    남성  3990   4291   294163241

        ID      연월         업종명 이용자구분    성별    이용자수    이용건수
0  ID_2575  201911     한식 음식점업  제주도민    여성  153363  163462
1  ID_6637  202305  건강보조식품 소매업    법인  알수없음     136     144

종속변수: 이용금액, 평가지표: rmse

In [58]:
X_train = train[[ '업종명', '이용자구분', '성별', '이용자수', '이용건수']]
X_test = test.drop(['ID', '연월'], axis=1)

y_train = train['이용금액']

In [59]:
print(X_train.nunique())
print(X_test.nunique())

업종명        15
이용자구분       7
성별          3
이용자수     1839
이용건수     1856
dtype: int64
업종명        15
이용자구분       7
성별          3
이용자수     2823
이용건수     2849
dtype: int64

In [53]:
X_train.isnull().sum()

ID       0
연월       0
업종명      0
이용자구분    0
성별       0
이용자수     0
이용건수     0
dtype: int64

In [63]:
from sklearn.model_selection import train_test_split

X_train_dum = pd.get_dummies(X_train)
X_test_dum = pd.get_dummies(X_test)

X_train, X_val, y_train, y_val = train_test_split(X_train_dum, y_train, test_size = 0.3)

In [65]:
from sklearn.ensemble import RandomForestRegressor

rf = RandomForestRegressor()
rf.fit(X_train, y_train)

y_val_predict = rf.predict(X_val)

In [69]:
from sklearn.metrics import mean_squared_error
import numpy as np

print('test rmse:', np.sqrt(mean_squared_error(y_val, y_val_predict)) )

test rmse: 154305538.21133155

In [73]:
# submission

submission = pd.DataFrame()
submission['ID'] = test['ID']
submission['price'] = rf.predict(X_test_dum)
submission.head()

        ID         price
0  ID_2575  6.306101e+09
1  ID_6637  3.970911e+07
2  ID_5704  2.904501e+06
3  ID_3606  2.015782e+06
4  ID_6443  5.392371e+05

## 3유형

In [231]:
import pandas as pd
df=pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e7_p3_1.csv')
df.head()

,Target,v1,v2,v3,v4,v5,v6,v7,v8,v9,...,v12,v13,v14,v15,v16,v17,v18,v19,v20,v21
0,21.650072,0.496714,-0.138264,0.647689,1.523030,-0.234153,-0.234137,1.579213,0.767435,-0.469474,...,-0.465730,0.241962,-1.913280,-1.724918,-0.562288,-1.012831,0.314247,-0.908024,-1.412304,1.465649
1,-19.469855,-0.225776,0.067528,-1.424748,-0.544383,0.110923,-1.150994,0.375698,-0.600639,-0.291694,...,-0.013497,-1.057711,0.822545,-1.220844,0.208864,-1.959670,-1.328186,0.196861,0.738467,0.171368
2,-24.475600,-0.115648,-0.301104,-1.478522,-0.719844,-0.460639,1.057122,0.343618,-1.763040,0.324084,...,0.611676,1.031000,0.931280,-0.839218,-0.309212,0.331263,0.975545,-0.479174,-0.185659,-1.106335
3,13.476831,-1.196207,0.812526,1.356240,-0.072010,1.003533,0.361636,-0.645120,0.361396,1.538037,...,-2.619745,0.821903,0.087047,-0.299007,0.091761,-1.987569,-0.219672,0.357113,1.477894,-0.518270
4,3.505322,-0.808494,-0.501757,0.915402,0.328751,-0.529760,0.513267,0.097078,0.968645,-0.702053,...,-1.463515,0.296120,0.261055,0.005113,-0.234587,-1.415371,-0.420645,-0.342715,-0.802277,-0.161286

### 1. 선형관계가 가장 큰 변수를 찾아 상관계수를 구하여라.

In [77]:
df.corr()['Target'].sort_values()

v13      -0.063199
v6       -0.052110
v18      -0.049140
v8       -0.047399
v11      -0.023574
v17      -0.021494
v10      -0.005766
v14      -0.005186
v20       0.003682
v7        0.006809
v19       0.015678
v16       0.018492
v21       0.019341
v12       0.026284
v9        0.038795
v15       0.051197
v5        0.168748
v1        0.345906
v2        0.394673
v4        0.600548
v3        0.627025
Target    1.000000
Name: Target, dtype: float64

In [78]:
df.corr().loc['Target','v3']

0.6270251925517436

### 2. Target 변수를 종속변수로 하여 다중선형회귀모델링을 진행했을 때 v2 칼럼의 회귀 계수는?

In [232]:
import numpy as np
import pandas as pd
import statsmodels.api as sm

X = df.drop('Target', axis=1)
X = sm.add_constant(X)

y = df['Target']

model = sm.OLS(y,X).fit()

print(model.params['v2'])

6.440301364843062

### 3. 회귀계수들이 가지는 p값들 중 최댓값은?

In [86]:
model.pvalues.max()

0.9179049883240253

### 4. train 데이터로 target을 종속변수로 로지스틱 회귀를 진행할 때 age 컬럼의 오즈비를 구하여라

In [2]:
import pandas as pd 
df= pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e7_p3_t.csv')
df.head()

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63.0,1.0,1.0,145.0,233.0,1.0,2.0,150.0,0.0,2.3,3.0,0.0,6.0,0
1,67.0,1.0,4.0,160.0,286.0,0.0,2.0,108.0,1.0,1.5,2.0,3.0,3.0,1
2,67.0,1.0,4.0,120.0,229.0,0.0,2.0,129.0,1.0,2.6,2.0,2.0,7.0,1
3,37.0,1.0,3.0,130.0,250.0,0.0,0.0,187.0,0.0,3.5,3.0,0.0,3.0,0
4,41.0,0.0,2.0,130.0,204.0,0.0,2.0,172.0,0.0,1.4,1.0,0.0,3.0,0

In [3]:
df.shape

(297, 14)

In [ ]:
import statsmodels.api as sm
from sklearn.model_selection import train_test_split
import numpy as np

X = df.drop('target', axis=1)
y = df['target']

X_train, X_test, y_train, y_test = train_test_split(X,y, test_size=0.3)

model = sm.Logit(y_train,X_train).fit()

# 오즈비
np.exp(model.params['age'])

Optimization terminated successfully.
         Current function value: 0.367479
         Iterations 7

0.971916052047073

### 5. train으로 로지스틱 회귀 진행했을 경우 잔차 이탈도(residual deviance)를 계산하라.

In [9]:
model2 = sm.GLM(y,X, family = sm.families.Binomial()).fit()

model2.deviance

211.60310196493361

In [10]:
model.summary()

<class 'statsmodels.iolib.summary.Summary'>
"""
                           Logit Regression Results
==============================================================================
Dep. Variable:                 target   No. Observations:                  207
Model:                          Logit   Df Residuals:                      194
Method:                           MLE   Df Model:                           12
Date:                Mon, 25 Nov 2024   Pseudo R-squ.:                  0.4696
Time:                        18:50:34   Log-Likelihood:                -76.068
converged:                       True   LL-Null:                       -143.42
Covariance Type:            nonrobust   LLR p-value:                 6.991e-23
==============================================================================
                 coef    std err          z      P>|z|      [0.025      0.975]
------------------------------------------------------------------------------
age           -0.0285      0.024     -1.195      0.232      -0.075       0.018
sex            0.9303      0.530      1.756      0.079      -0.108       1.968
cp             0.3729      0.202      1.846      0.065      -0.023       0.769
trestbps       0.0132      0.012      1.142      0.254      -0.009       0.036
chol           0.0019      0.004      0.461      0.645      -0.006       0.010
fbs           -1.2249      0.606     -2.021      0.043      -2.413      -0.037
restecg        0.2615      0.223      1.171      0.241      -0.176       0.699
thalach       -0.0375      0.010     -3.918      0.000      -0.056      -0.019
exang          0.9352      0.502      1.864      0.062      -0.048       1.919
oldpeak        0.1511      0.250      0.604      0.546      -0.339       0.642
slope          0.3080      0.410      0.751      0.453      -0.496       1.112
ca             1.4838      0.308      4.814      0.000       0.880       2.088
thal           0.2696      0.123      2.193      0.028       0.029       0.510
==============================================================================
"""

In [12]:
model2.summary() # 암튼 결과가 다르다..

<class 'statsmodels.iolib.summary.Summary'>
"""
                 Generalized Linear Model Regression Results
==============================================================================
Dep. Variable:                 target   No. Observations:                  297
Model:                            GLM   Df Residuals:                      284
Model Family:                Binomial   Df Model:                           12
Link Function:                  Logit   Scale:                          1.0000
Method:                          IRLS   Log-Likelihood:                -105.80
Date:                Mon, 25 Nov 2024   Deviance:                       211.60
Time:                        18:51:10   Pearson chi2:                     294.
No. Iterations:                     6   Pseudo R-squ. (CS):             0.4872
Covariance Type:            nonrobust
==============================================================================
                 coef    std err          z      P>|z|      [0.025      0.975]
------------------------------------------------------------------------------
age           -0.0454      0.020     -2.223      0.026      -0.085      -0.005
sex            0.9617      0.451      2.134      0.033       0.078       1.845
cp             0.3951      0.174      2.271      0.023       0.054       0.736
trestbps       0.0154      0.010      1.553      0.120      -0.004       0.035
chol           0.0027      0.004      0.729      0.466      -0.005       0.010
fbs           -0.8086      0.532     -1.519      0.129      -1.852       0.234
restecg        0.2708      0.183      1.482      0.138      -0.087       0.629
thalach       -0.0385      0.008     -4.837      0.000      -0.054      -0.023
exang          0.8409      0.407      2.066      0.039       0.043       1.639
oldpeak        0.2657      0.208      1.276      0.202      -0.142       0.674
slope          0.2701      0.339      0.796      0.426      -0.395       0.935
ca             1.2641      0.259      4.881      0.000       0.756       1.772
thal           0.3485      0.101      3.443      0.001       0.150       0.547
==============================================================================
"""

### 6. train으로 로지스틱 회귀를 진행했을 경우의 로짓 우도값을 도출하라.

In [13]:
# 모르겠다..

### 7. test 데이터의 독립변수로 target 예측 후 오류율을 구하여라

In [22]:
# 오류율 = 1 - accuracy
from sklearn.metrics import accuracy_score

pred = (model.predict(X_test) > 0.5).astype('int')
error_rate = 1 - accuracy_score(pred,y_test)
error_rate

0.1333333333333333

In [17]:
y_test

24     1
110    1
53     0
257    0
26     0
      ..
10     0
259    0
277    0
8      1
273    0
Name: target, Length: 90, dtype: int64

# 6회

## 1유형

In [23]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e6_p1_1.csv')
df.head(5)

,구급보고서번호,소방서명,환자증상구분명1,신고일자,신고시각,출동일자,출동시각,환자직업명,사고발생장소
0,20211122103M01526,중랑소방서,심계항진,20210330,104800,20210330,105042,무직,집
1,20211111105M00771,노원소방서,복통,20210412,225600,20210412,225827,기타,집
2,20211115104M00864,서초소방서,심계항진,20210303,194100,20210303,194500,직장인,상업시설
3,20211113107M01869,마포소방서,고열,20211225,235400,20211226,331,유아,집
4,20211118102M05820,강동소방서,고열,20211019,12100,20211019,12322,무직,집

### 1. 각 구급 보고서 별 출동시각과 신고시각의 차이를 초(sec) 단위로 구하여 '소요시간' 컬럼으로 만들고, 소방서명 별 소요시간의 평균을 오름차순으로 정렬했을 때 3번째로 작은 소요시간 값과 소방서명을 출력하여라

In [47]:
df['출동'] = pd.to_datetime(df['출동일자'].astype('str') + df['출동시각'].astype('str').str.zfill(6))
df['신고'] = pd.to_datetime(df['신고일자'].astype('str')+df['신고시각'].astype('str').str.zfill(6))
df['소요시간'] = (df['출동']-df['신고']).dt.total_seconds()

In [59]:
num_1 = df[['소방서명','소요시간']].groupby('소방서명').mean().sort_values('소요시간').reset_index()

In [66]:
num_1.loc[2]

소방서명    종로소방서
소요시간    175.5
Name: 2, dtype: object

### 2. 학교 세부유형이 일반중학교인 학교들 중 일반중학교 숫자가 2번째로 많은 시도의 일반중학교 데이터만 필터하여 해당 시도의 교원 한 명 당 맡은 학생 수가 가장 많은 학교를 찾아서 해당 학교의 교원수를 출력하라.

In [80]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e6_p1_2.csv')
df.head()

               학교명  시도  학교세부유형  일반학급_학생수_계  교원수_총계_계
0  서울대학교사범대학부설고등학교  서울  일반고등학교         689        73
1           가락고등학교  서울  일반고등학교         765        70
2           개포고등학교  서울  일반고등학교         684        69
3           경기고등학교  서울  일반고등학교        1047        96
4           경동고등학교  서울  일반고등학교         529        58

In [81]:
num_2 = df[df['학교세부유형']=='일반중학교']
num_2.groupby('시도').size().sort_values()   # 서울이 2번째로 많음

시도
세종     27
제주     45
울산     63
대전     88
광주     90
대구    124
충북    128
인천    143
강원    160
부산    166
충남    186
전북    209
전남    253
경북    266
경남    266
서울    387
경기    659
dtype: int64

In [89]:
num_2 = num_2[num_2['시도']=='서울'].reset_index(drop=True)
num_2['학생수per교원'] = num_2['일반학급_학생수_계'] / num_2['교원수_총계_계']
num_2[num_2['학생수per교원']==num_2['학생수per교원'].max()]['교원수_총계_계']

294    33
Name: 교원수_총계_계, dtype: int64

### 3. 5대 범죄(절도, 사기, 배임, 방화, 폭행)의 월별 총 발생건수를 총범죄수라고 표현하자. 18,19년의 각각 분기별 총범죄수의 월평균 값을 구했을때 최대값을 가지는 년도와 분기를 구하고 해당 분기의 최댓값의 사기가 발생한 월의 사기 발생건수를 출력하라  
(1분기:1,2,3월 / 2분기 : 4,5,6월 / 3분기 7,8,9월 / 4분기 10,11,12월 , 1분기 월평균 : 1,2,3월의 총범죄수 평균)

In [91]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e6_p1_3.csv')
df.head()

       범죄분류     절도     사기   배임   방화     폭행
0  2018년_1월  13280  25318  656  143  12186
1  2018년_2월  12504  19159  403  135  12087
2  2018년_3월  14733  24509  471  148  13841
3  2018년_4월  14781  23147  414  135  13973
4  2018년_5월  15988  23584  451  127  14117

In [ ]:
df['총범죄수'] = df.절도 + df.사기 + df.배임 + df.방화 + df.폭행
df['분기'] = [x+'_'+str(y)+'분기' for x in ['2018','2019'] for y in range(1,5) for z in range(3) ]
df.groupby('분기').sum().sort_values('총범죄수')  # 2019 2분기

/var/folders/fd/1n9xc_8d2d51bf04p61cdylw0000gn/T/ipykernel_53017/1863056558.py:3: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('분기').sum().sort_values('총범죄수')

             절도     사기    배임   방화     폭행    총범죄수
분기
2018_1분기  40517  68986  1530  426  38114  149573
2018_4분기  41870  68322  1388  350  39515  151445
2019_1분기  43705  77723  1562  350  36072  159412
2018_2분기  46513  69732  1318  372  42452  160387
2019_4분기  43957  77158  1465  304  37863  160747
2018_3분기  48558  71526  1552  330  44419  166385
2019_3분기  50392  77999  1491  321  44801  175004
2019_2분기  49575  80713  1478  370  43179  175315

In [103]:
df[df['분기']=='2019_2분기']

        범죄분류     절도     사기   배임   방화     폭행   총범죄수        분기
15  2019년_4월  15305  27125  478  138  13322  56368  2019_2분기
16  2019년_5월  17333  27766  509  131  14572  60311  2019_2분기
17  2019년_6월  16937  25822  491  101  15285  58636  2019_2분기

In [104]:
df[df['범죄분류']=='2019년_5월']['사기']

16    27766
Name: 사기, dtype: int64

## 2유형

In [133]:
import pandas as pd
train = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/ep6_p2_train.csv')
test = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/ep6_p2_test.csv')

display(train.head(2))
test.head(2)

,ID,General_Health,Checkup,Exercise,Heart_Disease,Skin_Cancer,Other_Cancer,Depression,Diabetes,Arthritis,Sex,Age_Category,Height_(cm),Weight_(kg),BMI,Smoking_History,Alcohol_Consumption,Fruit_Consumption,Green_Vegetables_Consumption,FriedPotato_Consumption
0,ID_1473,Good,Within the past 2 years,Yes,No,No,No,No,No,Yes,Female,55-59,168.0,77.11,27.44,No,1.0,12.0,4.0,4.0
1,ID_2045,Good,Within the past 2 years,Yes,No,No,No,No,No,No,Female,40-44,152.0,58.97,25.39,No,0.0,8.0,16.0,8.0

,ID,Checkup,Exercise,Heart_Disease,Skin_Cancer,Other_Cancer,Depression,Diabetes,Arthritis,Sex,Age_Category,Height_(cm),Weight_(kg),BMI,Smoking_History,Alcohol_Consumption,Fruit_Consumption,Green_Vegetables_Consumption,FriedPotato_Consumption
0,ID_14547,Within the past year,Yes,No,No,No,No,No,No,Male,35-39,180.0,81.65,25.10,No,15.0,8.0,25.0,12.0
1,ID_26,5 or more years ago,No,No,Yes,No,No,No,No,Male,60-64,183.0,79.38,23.73,No,1.0,4.0,4.0,4.0

In [106]:
train.nunique()

ID                              11230
General_Health                      3
Checkup                             5
Exercise                            2
Heart_Disease                       2
Skin_Cancer                         2
Other_Cancer                        2
Depression                          2
Diabetes                            4
Arthritis                           2
Sex                                 2
Age_Category                       13
Height_(cm)                        57
Weight_(kg)                       304
BMI                              1629
Smoking_History                     2
Alcohol_Consumption                30
Fruit_Consumption                  49
Green_Vegetables_Consumption       47
FriedPotato_Consumption            37
dtype: int64

In [107]:
test.nunique()

ID                              4813
Checkup                            5
Exercise                           2
Heart_Disease                      2
Skin_Cancer                        2
Other_Cancer                       2
Depression                         2
Diabetes                           4
Arthritis                          2
Sex                                2
Age_Category                      13
Height_(cm)                       44
Weight_(kg)                      241
BMI                             1136
Smoking_History                    2
Alcohol_Consumption               29
Fruit_Consumption                 36
Green_Vegetables_Consumption      34
FriedPotato_Consumption           29
dtype: int64

In [108]:
train.isnull().sum()

ID                              0
General_Health                  0
Checkup                         0
Exercise                        0
Heart_Disease                   0
Skin_Cancer                     0
Other_Cancer                    0
Depression                      0
Diabetes                        0
Arthritis                       0
Sex                             0
Age_Category                    0
Height_(cm)                     0
Weight_(kg)                     0
BMI                             0
Smoking_History                 0
Alcohol_Consumption             0
Fruit_Consumption               0
Green_Vegetables_Consumption    0
FriedPotato_Consumption         0
dtype: int64

In [110]:
test.isnull().sum()

ID                              0
Checkup                         0
Exercise                        0
Heart_Disease                   0
Skin_Cancer                     0
Other_Cancer                    0
Depression                      0
Diabetes                        0
Arthritis                       0
Sex                             0
Age_Category                    0
Height_(cm)                     0
Weight_(kg)                     0
BMI                             0
Smoking_History                 0
Alcohol_Consumption             0
Fruit_Consumption               0
Green_Vegetables_Consumption    0
FriedPotato_Consumption         0
dtype: int64

In [134]:
X_train = train.drop(['ID','General_Health'],axis=1)
y_train = train['General_Health']
X_test = test.drop('ID',axis=1)

X_train_dum = pd.get_dummies(X_train)
X_test_dum = pd.get_dummies(X_test)[X_train_dum.columns]

In [135]:
from sklearn.model_selection import train_test_split
from sklearn.ensemble import RandomForestClassifier
from sklearn.metrics import f1_score

X_train, X_val, y_train, y_val = train_test_split(X_train_dum, y_train)

rf = RandomForestClassifier()
rf.fit(X_train, y_train)

predict_val = rf.predict(X_val)
f1_score(predict_val,y_val, average='macro')

0.5477090386726945

## 3유형

### 1번

A 도시의 남성 600명과 여성 550명이 있다. 남성들 중 흡연자 비율은 0.2이며 여성들 중 흡연자 비율은 0.26이다.
남성과 여성 간에 흡연 여부에 따른 인구 비율이 다른지 확인하고 싶다. 유의 수준 0.05하 귀무가설에 대해 기각 / 채택 여부와 p-value값을 각각 출력하라  
=> 카이제곱 검정 수행

In [ ]:
import numpy as np
import scipy.stats as stats

# 남&여 인구 수
total_male = 600
total_female = 550

# 흡연자 비율
male_smoking_ratio = 0.2
female_smoking_ratio = 0.26

# 흡연 인구 수
smoking_male = total_male * male_smoking_ratio
non_smoking_male = total_male - smoking_male
smoking_female = total_female * female_smoking_ratio
non_smoking_female = total_female - smoking_female

# 빈도표 생성
data = np.array([[smoking_male, non_smoking_male], [smoking_female, non_smoking_female]])

# 카이제곱 검정
stats.chi2_contingency(data)  # 통계량 / p-value / dof / expected 순서

(5.521247671393307,
 0.018786854975740768,
 1,
 array([[137.2173913, 462.7826087],
        [125.7826087, 424.2173913]]))

p-value가 0.01으로 0.05보다 작으므로 H0 기각
=> 인구 비율이 다르다는 결론

### 2번  
(a): age와 Cholesterol을 가지고 weight를 예측하는 선형 회귀 모델을 만들려고한다. age의 회귀 계수를 구하여라.  
(b): age가 고정일 때 Cholesterol와 weight가 선형관계에 있다는 가설을 유의수준 0.05하에 검정하라.  
(c): age가 55, Cholesterol가 72.6일때 위 모델을 기반으로 weight값을 예측하라.

In [136]:
import pandas as pd 
df= pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/adp/28/p7.csv')
df.head()

   age  Cholesterol  weight
0   65         69.0   111.0
1   54        117.0    81.0
2   61         86.2    72.0
3   57         76.0    78.0
4   62        160.0    61.0

In [141]:
import statsmodels.api as sm

X = sm.add_constant(df[['age','Cholesterol']])
y = df['weight']

model = sm.OLS(y,X)
results = model.fit()

In [143]:
# age의 회귀 계수

results.params

const          74.895281
age            -0.036102
Cholesterol     0.081929
dtype: float64

In [145]:
# cholesterol과 weight가 선형관계에 있다는 가설 검정

if results.pvalues['Cholesterol'] < 0.05:
    print('Cholesterol과 weight가 선형관계에 있다.')
else:
    print('Cholesterol과 weight가 선형관계에 있지 않다.')

Cholesterol과 weight가 선형관계에 있다.

In [147]:
# age가 55, Cholesterol이 72.6일 때 weight 예측

results.predict([1,55,72.6]) # const, age, cholesterol

array([78.85771011])

# 5회

## 1유형

### 1. 20L가격과 5L가격이 모두 0원이 아닌 데이터만 필터를 한 후, 각 row별로 20L가격과 5L가격의 차이를 ‘차이가격’ 이라 부른다고 하자. 시도명 별 차이가격의 평균가격을 비교할때 그 값이 가장 큰 금액을 반올림하여 소숫점 이하 1자리까지 구하여라

In [148]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e5_p1_1_.csv')
df.head(5)

,시도명,시군구명,종량제봉투종류,종량제봉투처리방식,종량제봉투용도,종량제봉투사용대상,1L가격,1.5L가격,2L가격,2.5L가격,...,60L가격,75L가격,100L가격,120L가격,125L가격,관리부서명,관리부서전화번호,데이터기준일자,제공기관코드,제공기관명
0,경기도,안양시,규격봉투,매립용,생활쓰레기,사업장용,0,0,0,0,...,0,2100,0,0,0,자원순환과,031-8045-5448,2022-08-12,3830000,경기도 안양시
1,경기도,안양시,규격봉투,매립용,생활쓰레기,기타,0,0,0,0,...,0,2100,0,0,0,자원순환과,031-8045-5448,2022-08-12,3830000,경기도 안양시
2,경기도,안양시,규격봉투,소각용,음식물쓰레기,가정용,0,50,0,80,...,0,0,0,0,0,자원순환과,031-8045-5448,2022-08-12,3830000,경기도 안양시
3,경기도,안양시,규격봉투,소각용,음식물쓰레기,사업장용,0,50,0,80,...,0,0,0,0,0,자원순환과,031-8045-5448,2022-08-12,3830000,경기도 안양시
4,경기도,안양시,규격봉투,소각용,음식물쓰레기,기타,0,50,0,80,...,0,0,0,0,0,자원순환과,031-8045-5448,2022-08-12,3830000,경기도 안양시

In [161]:
num_1 = df[(df['20L가격']!=0) & (df['5L가격']!=0)]
num_1['차이가격'] = num_1['20L가격'] - num_1['5L가격']

num_1.groupby('시도명').mean()['차이가격'].sort_values(ascending=False)[0]

/var/folders/fd/1n9xc_8d2d51bf04p61cdylw0000gn/T/ipykernel_53017/383630005.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  num_1['차이가격'] = num_1['20L가격'] - num_1['5L가격']
/var/folders/fd/1n9xc_8d2d51bf04p61cdylw0000gn/T/ipykernel_53017/383630005.py:4: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  num_1.groupby('시도명').mean()['차이가격'].sort_values(ascending=False)[0]

619.0

### 2. BMI는 몸무게(kg) / (키(M) * 키(M)) 로 정의 된다. 초고도 비만은 BMI 25이상 , 고도 비반은 BMI 25미만 - 23이상 , 정상은 23미만 - 18.5이상 저체중은 18.5미만으로 정의 된다. 주어진 데이터에서 초고도비만 인원 + 저체중 인원 의 숫자는?

In [162]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e5_p1_2_.csv')
df.head(5)

       ID  height(cm)  weight(kg)
0  user_1       173.0        67.5
1  user_2       149.5        82.5
2  user_3       143.8        64.6
3  user_4       163.1        87.2
4  user_5       159.6        77.1

In [174]:
df['height(M)'] = df['height(cm)'] / 100
df['BMI'] = df['weight(kg)'] / (df['height(M)'] * df['height(M)'])

def app(x):
    if x['BMI'] >= 25:
        return '초고도비만'
    elif x['BMI'] >= 23:
        return '고도비만'
    elif x['BMI'] >= 18.5:
        return '정상'
    else:
        return '저체중'
    

df['분류'] = df.apply(app, axis=1)

In [175]:
num_2 = df.분류.value_counts()

In [176]:
num_2['초고도비만'] + num_2['저체중']

8998

### 3. 순유입인원은 초중고 도내,도외 전입인원에서 초중고 도내, 도외 전출인원을 뺀값이다. 각년도별로 가장 큰 순유입인원을 가진 지역구의 순유입인원을 구하고 전체 기간의 해당 순유입인원들의 합을 구하여라

In [177]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e5_p1_3.csv')
df.head(5)

,지역,초등학교_전출_도내,초등학교_전출_도외,초등학교_전입_도내,초등학교_전입_도외,중학교_전출_도내,중학교_전출_도외,중학교_전입_도내,중학교_전입_도외,고등학교_전출_도내,고등학교_전출_도외,고등학교_전입_도내,고등학교_전입_도외,년도
0,종로구,221,132,255,126,63,71,104,73,203,72,166,75,2012
1,중구,295,139,203,100,66,43,58,44,156,37,104,39,2012
2,용산구,380,269,302,174,134,78,91,106,102,66,113,48,2012
3,성동구,643,344,376,221,154,103,98,82,179,37,153,41,2012
4,광진구,560,382,595,312,165,158,158,118,115,70,154,66,2012

In [189]:
df['순유입인원'] = df['초등학교_전입_도내'] + df['초등학교_전입_도외'] + df['중학교_전입_도내'] + df['중학교_전입_도외'] + df['고등학교_전입_도내'] + df['고등학교_전입_도외'] - df['초등학교_전출_도내'] - df['초등학교_전출_도외'] - df['중학교_전출_도내'] - df['중학교_전출_도외'] - df['고등학교_전출_도내'] - df['고등학교_전출_도외']

df.groupby(['년도','지역'], as_index=False).sum()[['년도','지역','순유입인원']].sort_values(['년도','순유입인원'],ascending=False).drop_duplicates('년도')['순유입인원'].sum()

13853

## 2유형

예측 변수 price, test.csv에 대해 ID별로 price 값을 예측하여 제출, 제출 데이터 컬럼은 ID와 price 두개만 존재해야함. 평가지표는 rmse

In [190]:
import pandas as pd
train = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e5_p2_train_.csv')
test = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e5_p2_test_.csv')

display(train.head(2))
test.head(2)

,ID,model,year,price,transmission,mileage,fuelType,tax,mpg,engineSize
0,10170,A Class,2012,11940,Automatic,46000,Diesel,30,64.2,2.1
1,9551,CL Class,2020,38624,Semi-Auto,19,Petrol,150,36.7,2.0

   ID      model  year transmission  mileage fuelType  tax   mpg  engineSize
0   0        SLK  2005    Automatic    63000   Petrol  325  32.1         1.8
1   2   SL CLASS  2016    Automatic     6200   Petrol  555  28.0         5.5

In [191]:
train.nunique()

ID              9823
model             26
year              25
price           3682
transmission       4
mileage         7550
fuelType           4
tax               38
mpg              116
engineSize        26
dtype: int64

In [192]:
test.nunique()

ID              3296
model             22
year              21
transmission       3
mileage         2788
fuelType           3
tax               29
mpg               94
engineSize        21
dtype: int64

In [193]:
train.isnull().sum()

ID              0
model           0
year            0
price           0
transmission    0
mileage         0
fuelType        0
tax             0
mpg             0
engineSize      0
dtype: int64

In [195]:
test.isnull().sum()

ID              0
model           0
year            0
transmission    0
mileage         0
fuelType        0
tax             0
mpg             0
engineSize      0
dtype: int64

In [196]:
len(train)

9823

In [197]:
len(test)

3296

In [206]:
X_train = train[['model', 'year', 'transmission','mileage', 'fuelType','tax','mpg','engineSize']]
X_test = test.drop('ID',axis=1)

y_train = train['price']

dum = pd.concat([X_train,X_test],axis=0)
dum = pd.get_dummies(dum)
X_train_dum = dum[:9823]
X_test_dum = dum[9823:]

In [209]:
from sklearn.model_selection import train_test_split
from sklearn.ensemble import RandomForestRegressor
X_train, X_val, y_train, y_val = train_test_split(X_train_dum, y_train)

rf = RandomForestRegressor()

rf.fit(X_train, y_train)

y_val_predict = rf.predict(X_val)

In [210]:
from sklearn.metrics import mean_squared_error
import numpy as np

rmse = np.sqrt(mean_squared_error(y_val_predict, y_val))
rmse

2701.1616155133447

In [213]:
# 결과

test_predict = rf.predict(X_test_dum)

submission = pd.DataFrame()
submission['ID'] = test.ID
submission['price'] = test_predict


submission

         ID         price
0         0   4726.150000
1         2  64860.200000
2        14  17400.590000
3        15  14541.330000
4        18  16883.190000
...     ...           ...
3291  13096  28686.320000
3292  13098  24121.830000
3293  13101  23998.420000
3294  13109  17085.880000
3295  13112  29180.123333

[3296 rows x 2 columns]

## 3유형

### 1. 55명 학생들의 키에 대한 표본 평균을 구하여라(반올림하여 소숫점 3째자리까지

In [214]:
import pandas as pd 
df= pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e5_p3_1.csv')
df.head()

       ID  height
0  user_1  164.57
1  user_2  174.99
2  user_3  171.41
3  user_4  162.47
4  user_5  167.11

In [216]:
np.round(np.mean(df.height),3)

169.937

### 2. t분포 양쪽 꼬리에서의 t 값을 구하여라 (반올림하여 소수4째자리까지)

### 3. 95% 신뢰구간을 구하여라(print(lower,upper) 방식으로 출력, 각각의 값은 소숫점 이하 3째자리까지)

이건 r로 하는걸로...

data<-read.csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e5_p3_1.csv')  
head(data,3)  
round(mean(data$height),3)  
t.test(data$height)

### 4. A,B,C 세 공장에서 생산한 동일한 제품의 길이 데이터이다.   공장간의 제품 길이 차이가 유의미한지 확인 하려한다. 3 그룹의 데이터에 대해 크루스칼-왈리스 검정을 사용하여 검정 통계량을 반올림하여 소숫점 이하 3자리까지 구하여라

### 5. 3그룹의 데이터에 대해 크루스칼-왈리스 검정을 사용하여 p-value를 반올림하여 소숫점 이하 3자리까지 구하여라. 귀무가설과 대립가설중 0.05 유의수준에서 유의한 가설을 출력하라

data <- read.csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e5_p3_2.csv')  
head(data,3)  
data  
kruskal.test(value~ID, data=data)

# 4회

## 1유형

In [220]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e4_p1_1.csv')
df.head(5)

,Store,Date,Weekly_Sales,Holiday_Flag,Temperature,Fuel_Price,CPI,Unemployment
0,1,05-02-2010,1643690.90,0,42.31,2.572,211.096358,8.106
1,1,12-02-2010,1641957.44,1,38.51,2.548,211.242170,8.106
2,1,19-02-2010,1611968.17,0,39.93,2.514,211.289143,8.106
3,1,26-02-2010,1409727.59,0,46.63,2.561,211.319643,8.106
4,1,05-03-2010,1554806.68,0,46.5,2.625,211.350143,8.106

### 1. Temperature컬럼에서 숫자가 아닌 문자들을 제거후 숫자 타입으로 바꾸고 3분위수에서 1분위수의 차이를 소숫점 이하 2자리까지 구하여라

In [228]:
df['Temperature'] = df.Temperature.str.replace('*','').astype(float)

round(df.Temperature.quantile(0.75) - df.Temperature.quantile(0.25),2)

/var/folders/fd/1n9xc_8d2d51bf04p61cdylw0000gn/T/ipykernel_53017/544598902.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df['Temperature'] = df.Temperature.str.replace('*','').astype(float)

27.48

### 2. Likes를 Comments로 나눈 비율이 20이상이면서 Keyword값이 minecraft인 영상들의 Views값의 평균을 정수로 구하여라

In [229]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e4_p1_2.csv')
df.head(5)

,Title,Video ID,Published At,Keyword,Likes,Comments,Views
0,Apple Pay Is Killing the Physical Wallet After...,wAZZ-UWGVHI,2022-08-23,tech,3407.0,672.0,135612.0
1,The most EXPENSIVE thing I own.,b3x28s61q3c,2022-08-24,tech,76779.0,4306.0,1758063.0
2,My New House Gaming Setup is SICK!,4mgePWWCAmA,2022-08-23,tech,63825.0,3338.0,1564007.0
3,Petrol Vs Liquid Nitrogen | Freezing Experimen...,kXiYSI7H2b0,2022-08-23,tech,71566.0,1426.0,922918.0
4,Best Back to School Tech 2022!,ErMwWXQxHp0,2022-08-08,tech,96513.0,5155.0,1855644.0

In [232]:
df['ratio'] = df['Likes'] / df['Comments']
int(df[(df['ratio'] >= 20) & (df['Keyword'] == 'minecraft') ].Views.mean())

1789084

### 3. date_added가 2018년 1월 이면서 country가 United Kingdom 단독 제작인 데이터의 갯수

In [233]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e4_p1_3.csv')
df.head(5)

,show_id,type,title,director,cast,country,date_added,release_year,rating,duration,listed_in,description
0,s1,Movie,Dick Johnson Is Dead,Kirsten Johnson,NaN,United States,"September 25, 2021",2020,PG-13,90 min,Documentaries,"As her father nears the end of his life, filmm..."
1,s2,TV Show,Blood & Water,NaN,"Ama Qamata, Khosi Ngema, Gail Mabalane, Thaban...",South Africa,"September 24, 2021",2021,TV-MA,2 Seasons,"International TV Shows, TV Dramas, TV Mysteries","After crossing paths at a party, a Cape Town t..."
2,s3,TV Show,Ganglands,Julien Leclercq,"Sami Bouajila, Tracy Gotoas, Samuel Jouy, Nabi...",NaN,"September 24, 2021",2021,TV-MA,1 Season,"Crime TV Shows, International TV Shows, TV Act...",To protect his family from a powerful drug lor...
3,s4,TV Show,Jailbirds New Orleans,NaN,NaN,NaN,"September 24, 2021",2021,TV-MA,1 Season,"Docuseries, Reality TV","Feuds, flirtations and toilet talk go down amo..."
4,s5,TV Show,Kota Factory,NaN,"Mayur More, Jitendra Kumar, Ranjan Raj, Alam K...",India,"September 24, 2021",2021,TV-MA,2 Seasons,"International TV Shows, Romantic TV Shows, TV ...",In a city of coaching centers known to train I...

In [256]:
df['date'] = pd.to_datetime(df.date_added)
num_3 = df[(df['date'].dt.year == 2018) & (df['date'].dt.month == 1) & (df['country'] == 'United Kingdom')]
len(num_3)

6

## 2유형

예측 변수 Segmentation, test.csv에 대해 ID별로 Segmentation의 클래스를 예측해서 저장후 제출, 제출 데이터 컬럼은 ID와 Segmentation 두개만 존재해야함. 평가지표는 macro f1 score

In [307]:
import pandas as pd
train = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e4_p2_train.csv')
test = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e4_p2_test.csv')

display(train.head(2))
test.head(2)

,ID,Gender,Ever_Married,Age,Graduated,Profession,Work_Experience,Spending_Score,Family_Size,Var_1,Segmentation
0,464357,Male,No,40,Yes,Artist,7.0,Low,1.0,Cat_6,A
1,459624,Male,No,18,No,Healthcare,NaN,Low,5.0,Cat_4,D

,ID,Gender,Ever_Married,Age,Graduated,Profession,Work_Experience,Spending_Score,Family_Size,Var_1
0,460406,Male,Yes,36,Yes,Healthcare,3.0,Low,2.0,Cat_6
1,466890,Male,Yes,47,Yes,Artist,0.0,Average,6.0,Cat_7

In [258]:
train.nunique()

ID                 4410
Gender                2
Ever_Married          2
Age                  67
Graduated             2
Profession            9
Work_Experience      15
Spending_Score        3
Family_Size           9
Var_1                 7
Segmentation          4
dtype: int64

In [259]:
test.nunique()

ID                 1488
Gender                2
Ever_Married          2
Age                  67
Graduated             2
Profession            9
Work_Experience      15
Spending_Score        3
Family_Size           9
Var_1                 7
dtype: int64

In [260]:
train.isnull().sum()

ID                   0
Gender               0
Ever_Married        96
Age                  0
Graduated           51
Profession          64
Work_Experience    513
Spending_Score       0
Family_Size        192
Var_1               50
Segmentation         0
dtype: int64

In [262]:
test.isnull().sum()

ID                   0
Gender               0
Ever_Married        22
Age                  0
Graduated           16
Profession          23
Work_Experience    142
Spending_Score       0
Family_Size         68
Var_1               12
dtype: int64

In [299]:
train.Var_1.value_counts()

Cat_6    3158
Cat_4     646
Cat_3     520
Cat_2     248
Cat_7     114
Cat_1      89
Cat_5      56
Name: Var_1, dtype: int64

In [310]:
# 결측치 채우기

train.Ever_Married = train.Ever_Married.fillna(train.Ever_Married.value_counts().index[0])
train.Graduated = train.Graduated.fillna(train.Graduated.value_counts().index[0])
train.Profession = train.Profession.fillna(train.Profession.value_counts().index[0])
train.Work_Experience = train.Work_Experience.fillna(train.Work_Experience.median())
train.Family_Size = train.Family_Size.fillna(train.Family_Size.median())
train.Var_1 = train.Var_1.fillna(train.Var_1.value_counts().index[0])

In [311]:
X_train = train.drop(['ID','Segmentation'],axis=1)
y_train = train['Segmentation']
X_test = test.drop('ID', axis=1)

X_train_dum = pd.get_dummies(X_train)
X_test_dum = pd.get_dummies(X_test)

In [312]:
from sklearn.model_selection import train_test_split
from sklearn.ensemble import RandomForestClassifier

X_train, X_val, y_train, y_val = train_test_split(X_train_dum, y_train)
rf = RandomForestClassifier()

rf.fit(X_train, y_train)

y_val_predict = rf.predict(X_val)

In [315]:
from sklearn.metrics import f1_score

f1_score(y_val, y_val_predict,average='macro')

0.39608737131818295

## 3유형

In [316]:
import pandas as pd 
df= pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e4_p3_1_.csv')
df.head()

         학번     학과 성별
0  DFSKJK_1   경영학과  여
1  DFSKJK_2   사회학과  여
2  DFSKJK_3  기계공학과  여
3  DFSKJK_4   경제학과  남
4  DFSKJK_5  기계공학과  여

### 1. 학과 평균 인원에 대한 값을 소숫점 이하 3자리까지 구하여라

In [319]:
num_1 = df.학과.value_counts()
round(num_1.mean(),3)

170.333

### 2. 카이제곱검정 독립성 검정 통계량을 소숫점 이하 3자리까지 구하여라

data <- read.csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e4_p3_1_.csv')  
chisq.test(x=data$학과, y = data$성별)

### 3. 어느 학교에서 수학 시험을 본 학생 100명 중 60명이 60점 이상을 받았다. 이 학교의 수학 시험의 평균 점수가 50점 이상인지 95%의 신뢰 수준에서 검정하려한다.
- 검정 통계량을 소숫점 이하 3자리에서 구하시오.
- pvalue를 소숫점 이하 3자리까지 구하고 귀무가설과 대립가설중 유의한 것을 출력하라.

$ Z = \frac{\^p-p_0}{\sqrt{\frac{p_0(1-p_0)}{n}}}$

In [321]:
n = 100
p_hat = 0.6
p_0 = 0.5
alpha = 0.5

Z = round((0.6 - 0.5) / np.sqrt((0.5*0.5)/100),3)
Z

2.0

In [322]:
import scipy.stats as stats
p_value = round(1 - stats.norm.cdf(Z),3)
p_value

0.023

# 모의고사 1회차

## 1유형

In [125]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/bank/train.csv')

In [61]:
df.head()

,ID,age,job,marital,education,default,balance,housing,loan,contact,day,month,campaign,pdays,previous,poutcome,y
0,13829,29,technician,single,tertiary,no,18254,no,no,cellular,11,may,2,-1,0,unknown,no
1,22677,26,services,single,secondary,no,512,yes,yes,unknown,5,jun,3,-1,0,unknown,no
2,10541,30,management,single,secondary,no,135,no,no,cellular,14,aug,2,-1,0,unknown,no
3,13689,41,technician,married,unknown,no,30,yes,no,cellular,10,jul,1,-1,0,unknown,no
4,11304,27,admin.,single,secondary,no,321,no,yes,unknown,2,sep,1,-1,0,unknown,no

### 1. 마케팅 응답 고객들의 나이를 10살 단위로 변환 했을 때, 가장 많은 인원을 가진 나이대는? (0~9 : 0 , 10~19 : 10)

### 2. 마케팅 응답 고객들의 나이를 10살 단위로 변환 했을 때, 가장 많은 나이대 구간의 인원은 몇명인가?

In [62]:
df['agecat'] = df.age.astype('str').str[:1]

In [63]:
df.agecat.value_counts().sort_values()  
# 30대가 가장 많다 (5056명)

9       6
1      18
8      57
7     193
6     460
2    1638
5    2244
4    3198
3    5056
Name: agecat, dtype: int64

### 3. 나이가 25살 이상 29살 미만인 응답 고객들중 housing컬럼의 값이 yes인 고객의 수는?

In [64]:
len(df[(df.age >= 25) & (df.age < 29) & (df.housing == 'yes')])

504

### 4. numeric한 값을 가지지 않은 컬럼들중 unique한 값을 가장 많이 가지는 컬럼은?

In [65]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12870 entries, 0 to 12869
Data columns (total 18 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   ID         12870 non-null  int64
 1   age        12870 non-null  int64
 2   job        12870 non-null  object
 3   marital    12870 non-null  object
 4   education  12870 non-null  object
 5   default    12870 non-null  object
 6   balance    12870 non-null  int64
 7   housing    12870 non-null  object
 8   loan       12870 non-null  object
 9   contact    12870 non-null  object
 10  day        12870 non-null  int64
 11  month      12870 non-null  object
 12  campaign   12870 non-null  int64
 13  pdays      12870 non-null  int64
 14  previous   12870 non-null  int64
 15  poutcome   12870 non-null  object
 16  y          12870 non-null  object
 17  agecat     12870 non-null  object
dtypes: int64(7), object(11)
memory usage: 1.8+ MB

In [ ]:
object_col = ['job','marital','education','default','housing','loan','contact','month','poutcome','y']

df[object_col].nunique().sort_values()  # job,month

default       2
housing       2
loan          2
y             2
marital       3
contact       3
education     4
poutcome      4
job          12
month        12
dtype: int64

### 5. balance 컬럼값들의 평균값 이상을 가지는 데이터를 ID값을 기준으로 내림차순 정렬했을때 상위 100개 데이터의 balance값의 평균은?

In [74]:
num_5 = df[df.balance >= df.balance.mean()].sort_values('ID', ascending = False)[:100]
num_5.balance.mean()

3473.73

### 6. 가장 많은 광고를 집행했던 날짜는 언제인가? (데이터 그대로 일(숫자),달(영문)으로 표기)

In [84]:
df.value_counts(['day','month'])

day  month
15   may      301
14   may      283
13   may      257
7    may      239
21   nov      221
             ...
4    oct        1
30   dec        1
     aug        1
19   mar        1
21   jun        1
Length: 303, dtype: int64

### 7. 데이터의 job이 unknown 상태인 고객들의 age 컬럼 값의 정규성을 검정하고자 한다. 샤피로 검정의 p-value값을 구하여라

data <- read.csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/bank/train.csv')  

df <- data[data$job=='unknown',]  
shapiro.test(df$age)

### 8. age와 balance의 상관계수를 구하여라

In [88]:
df.corr().loc['age','balance']

/var/folders/fd/1n9xc_8d2d51bf04p61cdylw0000gn/T/ipykernel_95701/2563718283.py:1: FutureWarning: The default value of numeric_only in DataFrame.corr is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.corr().loc['age','balance']

0.10198734763981462

### 9 . y 변수와 education 변수는 독립인지 카이제곱검정을 통해 확인하려한다. p-value값을 출력하라

tst <- chisq.test(data$y, data$education)  
tst$p.value

### 10. 각 job에 따라 divorced/married 인원의 비율을 확인 했을 때 그 값이 가장 높은 값은?

In [ ]:
dt = df.groupby(['job','marital']).size().reset_index()
num_10 = dt.pivot_table(index='job',columns='marital')[0]
num_10 = num_10.fillna(0)
num_10['ratio'] = num_10['divorced'] / num_10['married']
num_10.sort_values('ratio', ascending = False).ratio
# 0.283105

In [127]:
num_10.pivot_table(index='job',columns='marital')
# num_10['ratio'] = num_10['divorced'] / num_10['married']
num_10

              job   marital     0
0          admin.  divorced   207
1          admin.   married   762
2          admin.    single   495
3     blue-collar  divorced   205
4     blue-collar   married  1775
5     blue-collar    single   591
6    entrepreneur  divorced    44
7    entrepreneur   married   272
8    entrepreneur    single    67
9       housemaid  divorced    49
10      housemaid   married   245
11      housemaid    single    40
12     management  divorced   323
13     management   married  1580
14     management    single   955
15        retired  divorced   157
16        retired   married   572
17        retired    single    41
18  self-employed  divorced    39
19  self-employed   married   284
20  self-employed    single   131
21       services  divorced   138
22       services   married   584
23       services    single   321
24        student   married    24
25        student    single   334
26     technician  divorced   246
27     technician   married  1115
28     technician    single   780
29     unemployed  divorced    62
30     unemployed   married   219
31     unemployed    single   133
32        unknown  divorced     5
33        unknown   married    58
34        unknown    single    17

## 2유형

In [1]:
import pandas as pd
train= pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/bank/train.csv')
test= pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/bank/test.csv')
submission= pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/bank/submission.csv')

display(train.head())
display(test.head())
display(submission.head())

,ID,age,job,marital,education,default,balance,housing,loan,contact,day,month,campaign,pdays,previous,poutcome,y
0,13829,29,technician,single,tertiary,no,18254,no,no,cellular,11,may,2,-1,0,unknown,no
1,22677,26,services,single,secondary,no,512,yes,yes,unknown,5,jun,3,-1,0,unknown,no
2,10541,30,management,single,secondary,no,135,no,no,cellular,14,aug,2,-1,0,unknown,no
3,13689,41,technician,married,unknown,no,30,yes,no,cellular,10,jul,1,-1,0,unknown,no
4,11304,27,admin.,single,secondary,no,321,no,yes,unknown,2,sep,1,-1,0,unknown,no

,ID,age,job,marital,education,default,balance,housing,loan,contact,day,month,campaign,pdays,previous,poutcome
0,53608,32,management,single,tertiary,no,12569,no,no,cellular,1,jul,2,295,2,success
1,51055,25,services,single,secondary,no,801,no,no,cellular,5,jun,2,-1,0,unknown
2,52573,46,blue-collar,married,secondary,no,1728,yes,no,unknown,26,may,2,-1,0,unknown
3,50458,39,management,divorced,secondary,no,51,no,no,unknown,17,jun,2,-1,0,unknown
4,52272,31,services,single,tertiary,no,1626,no,no,unknown,31,jul,1,-1,0,unknown

      ID  predict
0  53608      0.0
1  51055      0.0
2  52573      0.0
3  50458      0.0
4  52272      0.0

In [142]:
display(train.isnull().sum())
display(test.isnull().sum())

ID           0
age          0
job          0
marital      0
education    0
default      0
balance      0
housing      0
loan         0
contact      0
day          0
month        0
campaign     0
pdays        0
previous     0
poutcome     0
y            0
dtype: int64

ID           0
age          0
job          0
marital      0
education    0
default      0
balance      0
housing      0
loan         0
contact      0
day          0
month        0
campaign     0
pdays        0
previous     0
poutcome     0
dtype: int64

In [144]:
display(train.nunique())
display(test.nunique())

ID           12870
age             76
job             12
marital          3
education        4
default          2
balance       4188
housing          2
loan             2
contact          3
day             31
month           12
campaign        36
pdays          461
previous        30
poutcome         4
y                2
dtype: int64

ID           4291
age            70
job            12
marital         3
education       4
default         2
balance      2290
housing         2
loan            2
contact         3
day            31
month          12
campaign       33
pdays         318
previous       23
poutcome        4
dtype: int64

In [20]:
from sklearn.preprocessing import LabelEncoder

label_encoder = LabelEncoder()

X_train = train.drop(['ID','y'],axis=1)
y_train = label_encoder.fit_transform(train['y'])
X_test = test.drop('ID',axis=1)

X_train_dum = pd.get_dummies(X_train)
X_test_dum = pd.get_dummies(X_test)

print(X_train_dum.shape)
print(X_test_dum.shape)

(12870, 50)
(4291, 50)

In [21]:
from sklearn.model_selection import train_test_split
from sklearn.ensemble import RandomForestClassifier
from sklearn.metrics import roc_auc_score

X_train, X_val, y_train, y_val = train_test_split(X_train_dum, y_train)

rf = RandomForestClassifier()
rf.fit(X_train,y_train)
y_val_predict = rf.predict_proba(X_val)

In [26]:
# 왜 오류나는지 모르겠음 짜증

# print('validation roc score:', roc_auc_score(y_val_predict[:,1],y_val))

# 모의고사 2회

## 1유형

In [97]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/stroke_/train.csv')

### 1. 성별이 Male인 환자들의 age의 평균값은?

In [38]:
df.age = df.age.replace('*82','82')
df.age = df.age.astype('int')

In [39]:
df[df.gender == 'Male'].age.mean()

44.68623481781376

### 2. bmi컬럼의 결측치를 결측치를 제외한 나머지 값들의 중앙값으로 채웠을 경우 bmi 컬럼의 평균을 소숫점 이하 3자리 까지 구하여라

In [52]:
round(df.bmi.fillna(df.bmi.median()).mean(),3)

29.166

### 3. bmi컬럼의 각 결측치들을 직전의 행의 bmi값으로 채웠을 경우 bmi 컬럼의 평균을 소숫점 이하 3자리 까지 구하여라

In [53]:
round(df.bmi.fillna(method='ffill').mean(),3)

29.188

### 4. bmi컬럼의 각 결측치들을 결측치를 가진 환자 나이대(10단위)의 평균 bmi 값으로 대체한 후 대체된 bmi 컬럼의 평균을 소숫점 이하 3자리 까지 구하여라

In [72]:
df['agecat'] = df.age.str[:-1]
df.agecat  = df.agecat.replace('','0')
df.agecat = df.agecat.replace('*8','8')
df.agecat = df.agecat.astype('int')

In [78]:
aa = df.groupby('agecat')['bmi'].mean()
aa

agecat
0    18.960784
1    24.477228
2    28.052747
3    31.751111
4    31.427097
5    31.894086
6    31.615873
7    30.447727
8    28.566667
Name: bmi, dtype: float64

In [86]:
lst = list()
for i in range(9):
    lst.append(df[df.agecat == i].bmi.fillna(aa[i]).mean())

In [87]:
len(lst)

9

In [88]:
lst[1]

24.477227722772273

In [90]:
a = 0
for i in range(len(lst)):
    a += lst[i]

print(a / len(lst))

28.57703557236911

### 5. avg_glucose_level 컬럼의 값이 200이상인 데이터를 모두 199로 변경하고 stroke값이 1인 데이터의 avg_glucose_level값의 평균을 소수점이하 3자리 까지 구하여라

In [101]:
num_5 = df.copy()

num_5.loc[num_5.avg_glucose_level >= 200,'avg_glucose_level'] = 199
round(num_5[num_5.stroke == 1].avg_glucose_level.mean(),3)

125.188

### 6. Attack컬럼의 값을 기준으로 내림차순정렬 했을때 상위 400위까지 포켓몬들과 401~800위까지의 포켓몬들에서 전설포켓몬(Legendary컬럼)의 숫자 차이는?

In [103]:
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/pok/Pokemon.csv')

df.head()

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,625,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,309,39,52,43,60,50,65,1,False

In [105]:
num_6 = df.sort_values('Attack',ascending=False)
upper = num_6[:400]
lower = num_6[400:]
len(upper[upper.Legendary]) - len(lower[lower.Legendary])

57

### 7. Type 1 컬럼의 종류에 따른 Total 컬럼의 평균값을 내림차순 정렬했을때 상위 3번째 Type 1은 무엇인가?

In [110]:
typelist = df['Type 1'].unique()
typelist

array(['Grass', 'Fire', 'Water', 'Bug', 'Normal', 'Poison', 'Electric',
       'Ground', 'Fairy', 'Fighting', 'Psychic', 'Rock', 'Ghost', 'Ice',
       'Dragon', 'Dark', 'Steel', 'Flying'], dtype=object)

In [ ]:
df.groupby('Type 1').Total.mean().sort_values(ascending=False)   # Flying

Type 1
Dragon      550.531250
Steel       487.703704
Flying      485.000000
Psychic     475.947368
Fire        458.076923
Rock        453.750000
Dark        445.741935
Electric    443.409091
Ghost       439.562500
Ground      437.500000
Ice         433.458333
Water       430.455357
Grass       421.142857
Fighting    416.444444
Fairy       413.176471
Normal      401.683673
Poison      399.142857
Bug         378.927536
Name: Total, dtype: float64

### 8. 결측치가 존재하는 행을 모두 지운 후 처음부터 순서대로 60% 데이터를 추출하여 Defense컬럼의 1분위수를 구하여라

In [120]:
num_8 = df.dropna()
num_8 = df[:len(num_8)]
num_8.Defense.quantile(0.25)

50.0

### 9. Type 1 컬럼의 속성이 Fire인 포켓몬들의 Attack의 평균이상인 Water속성의 포켓몬 수를 구하여라

In [125]:
m = df[df['Type 1'] == 'Fire'].Attack.mean()
len(df[(df.Attack >= m) & (df['Type 1'] == 'Water')])

37

### 10. 각 세대 중(Generation 컬럼)의 Speed와 Defense 컬럼의 차이(절댓값)이 가장 큰 세대는?

In [ ]:
num_10 = df.copy()
num_10 = num_10.groupby('Generation')[['Speed','Defense']].mean().reset_index()
num_10['diff'] = abs(num_10.Speed - num_10.Defense)
num_10.sort_values('diff', ascending = False)  # 2세대

   Generation      Speed    Defense       diff
1           2  61.811321  73.386792  11.575472
5           6  66.439024  76.682927  10.243902
2           3  66.925000  74.100000   7.175000
3           4  71.338843  78.132231   6.793388
4           5  68.078788  72.327273   4.248485
0           1  72.584337  70.861446   1.722892

## 2유형

In [227]:
import pandas as pd
train= pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/stroke_/train.csv')
test= pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/stroke_/test.csv')

display(train.head())
display(test.head())

,id,gender,age,hypertension,heart_disease,ever_married,work_type,Residence_type,avg_glucose_level,bmi,smoking_status,stroke
0,1192,Female,31,0,0,No,Govt_job,Rural,70.66,27.2,never smoked,0
1,77,Female,13,0,0,No,children,Rural,85.81,18.6,Unknown,0
2,59200,Male,18,0,0,No,Private,Urban,60.56,33.0,never smoked,0
3,24905,Female,65,0,0,Yes,Private,Urban,205.77,46.0,formerly smoked,1
4,24257,Male,4,0,0,No,children,Rural,90.42,16.2,Unknown,0

,id,gender,age,hypertension,heart_disease,ever_married,work_type,Residence_type,avg_glucose_level,bmi,smoking_status
0,47472,Female,58,0,0,Yes,Private,Urban,107.26,38.6,formerly smoked
1,36841,Male,78,1,0,Yes,Self-employed,Rural,56.11,25.5,formerly smoked
2,3135,Female,73,0,0,No,Self-employed,Rural,69.35,NaN,never smoked
3,65218,Male,2,0,0,No,children,Rural,109.10,20.0,Unknown
4,1847,Female,20,0,0,No,Govt_job,Rural,79.53,NaN,never smoked

In [213]:
print(train.isnull().sum())
print(test.isnull().sum())
print(train.nunique())
print(test.nunique())

id                   0
gender               0
age                  0
hypertension         0
heart_disease        0
ever_married         0
work_type            0
Residence_type       0
avg_glucose_level    0
bmi                  0
smoking_status       0
stroke               0
dtype: int64
id                   0
gender               0
age                  0
hypertension         0
heart_disease        0
ever_married         0
work_type            0
Residence_type       0
avg_glucose_level    0
bmi                  0
smoking_status       0
dtype: int64
id                   1137
gender                  3
age                    83
hypertension            2
heart_disease           2
ever_married            2
work_type               5
Residence_type          2
avg_glucose_level    1069
bmi                   309
smoking_status          4
stroke                  2
dtype: int64
id                   932
gender                 2
age                   83
hypertension           2
heart_disease          2
ever_married           2
work_type              5
Residence_type         2
avg_glucose_level    894
bmi                  285
smoking_status         4
dtype: int64

In [228]:
train['bmi'] = train.bmi.fillna(train.bmi.mean())
test['bmi'] = test.bmi.fillna(test.bmi.mean())

In [229]:
X_train = train.drop(['id','stroke'],axis=1)
y_train = train['stroke']
X_test = test.drop('id',axis=1)

print(X_train.shape, X_test.shape)
concat = pd.concat([X_train, X_test], axis=0)
print(concat.shape)
concat = pd.get_dummies(concat)
X_train_dum = concat[:1137]
X_test_dum = concat[1137:]

print(X_train_dum.shape, X_test_dum.shape)
print(y_train.shape)

(1137, 10) (932, 10)
(2069, 10)
(1137, 187) (932, 187)
(1137,)

In [230]:
from sklearn.model_selection import train_test_split
from sklearn.ensemble import RandomForestClassifier
from sklearn.metrics import roc_auc_score

X_train, X_val, y_train, y_val = train_test_split(X_train_dum, y_train)

rf = RandomForestClassifier()
rf.fit(X_train, y_train)
y_val_predict = rf.predict_proba(X_val)[:,1]
print(y_val_predict)

print('auc score:', roc_auc_score(y_val, y_val_predict))

[0.16 0.05 0.   0.02 0.12 0.1  0.06 0.08 0.18 0.37 0.01 0.59 0.   0.01
 0.06 0.03 0.11 0.26 0.04 0.14 0.01 0.13 0.25 0.   0.34 0.07 0.   0.
 0.17 0.07 0.13 0.11 0.   0.07 0.   0.01 0.19 0.   0.1  0.08 0.05 0.16
 0.12 0.02 0.14 0.07 0.02 0.08 0.   0.35 0.06 0.   0.01 0.3  0.   0.27
 0.15 0.   0.02 0.13 0.   0.06 0.3  0.11 0.02 0.05 0.13 0.05 0.01 0.02
 0.   0.55 0.42 0.   0.07 0.07 0.   0.11 0.02 0.25 0.31 0.13 0.21 0.03
 0.08 0.1  0.26 0.   0.04 0.25 0.3  0.08 0.03 0.01 0.12 0.05 0.03 0.08
 0.01 0.   0.01 0.27 0.   0.01 0.05 0.   0.13 0.12 0.02 0.02 0.12 0.18
 0.15 0.04 0.09 0.15 0.   0.2  0.36 0.   0.04 0.   0.01 0.46 0.17 0.14
 0.06 0.07 0.11 0.05 0.1  0.11 0.04 0.29 0.16 0.1  0.   0.18 0.15 0.02
 0.3  0.18 0.02 0.12 0.02 0.   0.18 0.   0.18 0.07 0.   0.19 0.08 0.
 0.05 0.16 0.08 0.15 0.06 0.06 0.   0.17 0.   0.1  0.06 0.27 0.09 0.08
 0.01 0.17 0.03 0.05 0.13 0.02 0.07 0.01 0.06 0.07 0.09 0.08 0.06 0.
 0.05 0.15 0.1  0.04 0.   0.02 0.08 0.02 0.25 0.08 0.29 0.04 0.03 0.05
 0.03 0.   0.   0.12 0.   0.04 0.01 0.28 0.04 0.05 0.02 0.04 0.48 0.
 0.   0.   0.07 0.04 0.03 0.   0.02 0.13 0.08 0.16 0.05 0.05 0.34 0.01
 0.01 0.21 0.47 0.11 0.31 0.04 0.   0.   0.01 0.   0.17 0.07 0.36 0.02
 0.23 0.53 0.12 0.13 0.07 0.11 0.09 0.23 0.   0.02 0.16 0.   0.   0.58
 0.08 0.06 0.11 0.04 0.04 0.   0.27 0.12 0.   0.06 0.33 0.05 0.07 0.02
 0.   0.68 0.04 0.04 0.   0.04 0.01 0.04 0.06 0.01 0.04 0.11 0.14 0.19
 0.31 0.01 0.19 0.03 0.08]
auc score: 0.7582285714285715